app/views/listings/_listing.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <h3 class="text-xl font-semibold"><%= listing.title %></h3>
  <% if listing.user.company_name.present? %>