app/views/listings/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
            <div class="mt-4 space-y-3">
              <% if @listing.user.company_name.present? %>