app/views/requests/_request.html.erb

      <h3 class="text-xl font-semibold"><%= request.title %></h3>
      <% if request.user.company_name.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]