app/views/requests/show.html.erb

            <div class="mt-4 space-y-3">
              <% if @request.user.company_name.present? %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]