app/controllers/home_controller.rb

SELECT "listings".* FROM "listings" ORDER BY "listings"."created_at" DESC LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]
SELECT "requests".* FROM "requests" ORDER BY "requests"."created_at" DESC LIMIT $1  [["LIMIT", 6]]
---
  def index
    @listings = Listing.order(created_at: :desc).limit(6)
    @requests = Request.order(created_at: :desc).limit(6)