app/controllers/listings_controller.rb

  def index
    @listings = Listing.order(created_at: :desc)

    # Apply filters if present
    @listings = @listings.where(city: params[:city]) if params[:city].present?
    @listings = @listings.where(state: params[:state]) if params[:state].present?
    @listings = @listings.where(zip_code: params[:zip_code]) if params[:zip_code].present?

    # Get unique cities for the filter
    @cities = Listing.distinct.pluck(:city).compact.sort
    @states = Listing.distinct.pluck(:state).compact.sort

    @listings = @listings.page(params[:page]).per(12)
---
SELECT "listings".* FROM "listings" ORDER BY "listings"."created_at" DESC
SELECT DISTINCT "listings"."city" FROM "listings"
SELECT DISTINCT "listings"."state" FROM "listings"
SELECT "listings".* FROM "listings" WHERE "listings"."city" = $1 ORDER BY "listings"."created_at" DESC LIMIT $2 OFFSET $3  [["city", "Brooklyn"], ["LIMIT", 12], ["OFFSET", 0]]

  def create
    @listing = current_user.listings.build(listing_params)

    if @listing.save
---
INSERT INTO "listings" ("title", "description", "price", "category", "condition", "user_id", "created_at", "updated_at", "initial_valuation", "runway_end_date", "city", "state", "zip_code") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    if @listing.update(listing_params)
---
UPDATE "listings" SET "updated_at" = $1, "city" = $2, "state" = $3, "zip_code" = $4 WHERE "listings"."id" = $5  [["updated_at", "2025-02-05 05:08:22.203819"], ["city", "Brooklyn"], ["state", "NY"], ["zip_code", "11204"], ["id", 2]]

  def destroy
    @listing.destroy
---
DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 2]]

  def set_listing
    @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]