app/controllers/listings_controller.rb

UPDATE "listings" SET "updated_at" = $1 WHERE "listings"."id" = $2  [["updated_at", "2025-02-05 03:22:40.028820"], ["id", 2]]
---
  def show
    @listing.increment_views