app/controllers/profiles_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "updated_at" = $1, "name" = $2, "company_name" = $3, "funded_by" = $4, "funding_raised" = $5 WHERE "users"."id" = $6  [["updated_at", "2025-02-05 04:43:22.824503"], ["name", "Adam Neumann"], ["company_name", "WeWork"], ["funded_by", "SoftBank"], ["funding_raised", "47000000000.0"], ["id", 1]]