app/controllers/requests_controller.rb

  def index
    @requests = Request.order(created_at: :desc)

    # Apply filters if present
    @requests = @requests.where(city: params[:city]) if params[:city].present?
    @requests = @requests.where(state: params[:state]) if params[:state].present?
    @requests = @requests.where(category: params[:category]) if params[:category].present?
    @requests = @requests.where('budget >= ?', params[:min_budget]) if params[:min_budget].present?
    @requests = @requests.where('budget <= ?', params[:max_budget]) if params[:max_budget].present?

    # Get unique values for filters
    @cities = Request.distinct.pluck(:city).compact.sort

    @requests = @requests.page(params[:page]).per(12)
---
SELECT DISTINCT "requests"."city" FROM "requests"
SELECT "requests".* FROM "requests" WHERE "requests"."city" = $1 ORDER BY "requests"."created_at" DESC LIMIT $2 OFFSET $3  [["city", "Brooklyn"], ["LIMIT", 12], ["OFFSET", 0]]

  def create
    @request = current_user.requests.build(request_params)

    if @request.save
---
INSERT INTO "requests" ("title", "description", "category", "budget", "user_id", "city", "state", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    if @request.update(request_params)
---
UPDATE "requests" SET "zip_code" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["zip_code", "11219"], ["updated_at", "2025-02-05 15:57:30.206096"], ["id", 1]]

  def set_request
    @request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]