app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."provider" = $1 AND "users"."uid" = $2 LIMIT $3  [["provider", "google_oauth2"], ["uid", "113373221339505347233"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "provider", "uid", "created_at", "updated_at", "name", "company_name", "funded_by", "funding_raised", "contact_preference", "twitter_handle", "sign_in_count", "current_sign_in_at", "last_sign_in_at", "current_sign_in_ip", "last_sign_in_ip") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def self.from_google(auth)
    # Find existing user by uid and provider
    user = User.find_by(provider: auth[:provider], uid: auth[:uid])

    return user if user

    # Create new user if not found
    User.create(
      provider: auth[:provider],
      uid: auth[:uid],
      email: auth[:email],
      password: Devise.friendly_token[0, 20]
    )